

const config = require('../config')
const {cmd , commands} = require('../command')
cmd({
    pattern: "about",
    react: "👑",
    desc: "get owner dec",
    category: "main",
    filename: __filename
},
async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{
let about = `*╭┈───────────────•*

*👾 HELLO ${pushname}*

*╰┈───────────────•*
 ⧉ •╭═══ ━ ━ • ━ ━ ━ ═══⧠
 ⧉ •│       「 𝗠𝗬 𝗜𝗡𝗧𝗥𝗢 」
 ⧉ •│ Name      : ᴍɪᴋᴀᴇʟ sᴘᴏɴsᴏʀ
 ⧉ •│
 ⧉ •│ Place      : ᴅɪʀɪɢᴇᴀɴᴛ
 ⧉ •│
 ⧉ •│ Gender    : ᴍᴀʟᴇ
 ⧉ •│
 ⧉ •│ Age       : [][]
 ⧉ •│
 ⧉ •│ Status     : 𝙳𝙴𝚅𝙴𝙻𝙾𝙿𝙴𝚁
 ⧉ •│
 ⧉ •│ Phone     : wa.me/22606527293
 ⧉ •│
 ⧉ •│ Github     : ᴍɪᴋᴀᴇʟᴋᴀʙᴏʀᴇ
 ⧉ •│
 ⧉ •╰═══ ━ ━ • ━ ━ ━ ═══⧠
 ⧉ • *卐卐卐卐卐卐卐卐卐*

 ⧉ •*[ • ᴛsᴜɴᴀᴅᴇ 𝚇𝙼𝙳 - TEAM • ]*
 ⧉ •*╭┈───────────────•*
 ⧉ •*│  ◦* *➩𝙼𝙸𝙺𝙰𝙴𝙻 𝚂𝙿𝙽𝚁*
 ⧉ •*│  ◦* *➩𝙹𝙴𝙽𝙸𝙵𝙴 𝚇𝙼*
 ⧉ •*│  ◦* *➩𝙻𝙾𝚁𝙳𝙴𝙴𝙿𝚂*
 ⧉ •*╰┈───────────────•*
 ⧉ •*⧖────────────•⧖*
> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴛsᴜɴᴀᴅᴇ xᴍᴅ
 ⧉ •*⧖────────────•⧖*
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:about},{quoted:mek})

}catch(e){
console.log(e)
reply(`${e}`)
}
})
